templator_hdf5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-07 Fri 10:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HDF5 back end</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX-CoE" />
<link rel="stylesheet" title="Standard" href="trexio.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">HDF5 back end</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf242665">1. HDF5 back end</a>
<ul>
<li><a href="#orgf3a8f26">1.1. Template for HDF5 definitions</a></li>
<li><a href="#org99c7e01">1.2. Template for HDF5 structures</a></li>
<li><a href="#orgd062364">1.3. Template for HDF5 init/deinit</a></li>
<li><a href="#orgb54ff12">1.4. Template for HDF5 has/read/write the numerical attribute</a></li>
<li><a href="#org3ca7f3f">1.5. Template for HDF5 has/read/write the dataset of numerical data</a></li>
<li><a href="#orgf806735">1.6. Template for HDF5 has/read/write the dataset of sparse data</a></li>
<li><a href="#org417a188">1.7. Template for HDF5 has/read/write the dataset of strings</a></li>
<li><a href="#org8a689b8">1.8. Template for HDF5 has/read/write the string attribute</a></li>
<li><a href="#orge07d0c5">1.9. Helper functions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf242665" class="outline-2">
<h2 id="orgf242665"><span class="section-number-2">1</span> HDF5 back end</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf3a8f26" class="outline-3">
<h3 id="orgf3a8f26"><span class="section-number-3">1.1</span> Template for HDF5 definitions</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#define</span> $GROUP$_GROUP_NAME          <span style="color: #8b2252;">"$group$"</span>
<span style="color: #483d8b;">#define</span> $GROUP_NUM$_NAME            <span style="color: #8b2252;">"$group_num$"</span>
<span style="color: #483d8b;">#define</span> $GROUP_DSET$_NAME           <span style="color: #8b2252;">"$group_dset$"</span>
<span style="color: #483d8b;">#define</span> $GROUP_STR$_NAME            <span style="color: #8b2252;">"$group_str$"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org99c7e01" class="outline-3">
<h3 id="org99c7e01"><span class="section-number-3">1.2</span> Template for HDF5 structures</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">trexio_hdf5_s</span> {
  <span style="color: #228b22;">trexio_t</span>     <span style="color: #a0522d;">parent</span> ;
  <span style="color: #228b22;">hid_t</span>        <span style="color: #a0522d;">file_id</span>;
  hid_t        $group$_group;
} <span style="color: #228b22;">trexio_hdf5_t</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd062364" class="outline-3">
<h3 id="orgd062364"><span class="section-number-3">1.3</span> Template for HDF5 init/deinit</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_init</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #228b22;">trexio_hdf5_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_hdf5_t</span>*) file;

  /* <span style="color: #b22222;">If file doesn't exist, create it </span>*/
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">f_exists</span> = 0;
  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">stat</span> <span style="color: #a0522d;">st</span>;

  <span style="color: #a020f0;">if</span> (stat(file-&gt;file_name, &amp;st) == 0) f_exists = 1;

  <span style="color: #a020f0;">if</span> (f_exists == 1) {

    <span style="color: #a020f0;">switch</span> (file-&gt;mode) {
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'r'</span>:
      // <span style="color: #b22222;">reading the existing file -&gt; open as RDONLY</span>
      f-&gt;file_id = H5Fopen(file-&gt;file_name, H5F_ACC_RDONLY, H5P_DEFAULT);
      <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'w'</span>:
      // <span style="color: #b22222;">writing the existing file -&gt; open as RDWRITE</span>
      f-&gt;file_id = H5Fopen(file-&gt;file_name, H5F_ACC_RDWR, H5P_DEFAULT);
      <span style="color: #a020f0;">break</span>;
    }

  } <span style="color: #a020f0;">else</span> {

    <span style="color: #a020f0;">switch</span> (file-&gt;mode) {
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'r'</span>:
      // <span style="color: #b22222;">reading non-existing file -&gt; error</span>
      <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'w'</span>:
      // <span style="color: #b22222;">writing non-existing file -&gt; create it</span>
      f-&gt;file_id = H5Fcreate(file-&gt;file_name, H5F_ACC_EXCL, H5P_DEFAULT, H5P_DEFAULT);
      <span style="color: #a020f0;">break</span>;
    }

  }

  /* <span style="color: #b22222;">Create or open groups in the hdf5 file assuming that they exist if file exists </span>*/
  <span style="color: #a020f0;">switch</span> (file-&gt;mode) {
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'r'</span>:
      f-&gt;$group$_group = H5Gopen(f-&gt;file_id, $GROUP$_GROUP_NAME, H5P_DEFAULT);
      <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'w'</span>:
      <span style="color: #a020f0;">if</span> (f_exists == 1) {
        f-&gt;$group$_group = H5Gopen(f-&gt;file_id, $GROUP$_GROUP_NAME, H5P_DEFAULT);
      } <span style="color: #a020f0;">else</span> {
        f-&gt;$group$_group = H5Gcreate(f-&gt;file_id, $GROUP$_GROUP_NAME, H5P_DEFAULT, H5P_DEFAULT, H5P_DEFAULT);
      }
      <span style="color: #a020f0;">break</span>;
  }
  <span style="color: #a020f0;">if</span> (f-&gt;$group$_group &lt;= 0L) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}

<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_deinit</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #228b22;">trexio_hdf5_t</span>* <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_hdf5_t</span>*) file;

  H5Gclose(f-&gt;$group$_group);
  f-&gt;$group$_group = 0;

  H5Fclose(f-&gt;file_id);
  f-&gt;file_id = 0;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;

}
</pre>
</div>
</div>
</div>
