templator_hdf5.html

<div id="outline-container-orgf806735" class="outline-3">
<h3 id="orgf806735"><span class="section-number-3">1.6</span> Template for HDF5 has/read/write the dataset of sparse data</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Sparse data is stored using extensible datasets of HDF5. Extensibility is required
due to the fact that the sparse data will be written in chunks of user-defined size.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_write_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span>* <span style="color: #a0522d;">index_sparse</span>,
                                <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>* <span style="color: #a0522d;">value_sparse</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_hdf5_t</span>* <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_hdf5_t</span>*) file;

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">index_dtype</span>;
  <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">index_p</span> = <span style="color: #008b8b;">NULL</span>;
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">size_ranked</span> = (<span style="color: #228b22;">uint64_t</span>) size * $group_dset_rank$;
  /* <span style="color: #b22222;">Determine the optimal type for storing indices depending on the size_max (usually mo_num or ao_num) </span>*/
  <span style="color: #a020f0;">if</span> (size_max &lt; UINT8_MAX) {
    <span style="color: #228b22;">uint8_t</span>* <span style="color: #a0522d;">index</span> = CALLOC(size_ranked, uint8_t);
    <span style="color: #a020f0;">if</span> (index == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;size_ranked; ++i){
      index[i] = (<span style="color: #228b22;">uint8_t</span>) index_sparse[i];
    }
    index_p = index;
    index_dtype = H5T_NATIVE_UINT8;
  } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (size_max &lt; UINT16_MAX) {
    <span style="color: #228b22;">uint16_t</span>* <span style="color: #a0522d;">index</span> = CALLOC(size_ranked, uint16_t);
    <span style="color: #a020f0;">if</span> (index == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;size_ranked; ++i){
      index[i] = (<span style="color: #228b22;">uint16_t</span>) index_sparse[i];
    }
    index_p = index;
    index_dtype = H5T_NATIVE_UINT16;
  } <span style="color: #a020f0;">else</span> {
    index_p = (<span style="color: #228b22;">int32_t</span>*) index_sparse;
    index_dtype = H5T_NATIVE_INT32;
  }

  /* <span style="color: #b22222;">Store float values in double precision </span>*/
  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">value_dtype</span> = H5T_NATIVE_DOUBLE;
  /* <span style="color: #b22222;">Arrays of chunk dims that will be used for chunking the dataset </span>*/
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">chunk_i_dims</span>[1] = {size_ranked};
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">chunk_v_dims</span>[1] = {size};

  /* <span style="color: #b22222;">Indices and values are stored as 2 independent datasets in the HDF5 file </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">dset_index_name</span>[256];
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">dset_value_name</span>[256];
  /* <span style="color: #b22222;">Build the names of the datasets </span>*/
  strncpy(dset_index_name, $GROUP_DSET$_NAME <span style="color: #8b2252;">"_indices"</span>, 256);
  strncpy(dset_value_name, $GROUP_DSET$_NAME <span style="color: #8b2252;">"_values"</span>, 256);

  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc_write</span> = TREXIO_FAILURE;
  /* <span style="color: #b22222;">NOTE: chunk size is set upon creation of the HDF5 dataset and cannot be changed ! </span>*/
  <span style="color: #a020f0;">if</span> ( H5LTfind_dataset(f-&gt;$group$_group, dset_index_name) != 1 ) {
  /* <span style="color: #b22222;">If the file does not exist -&gt; create it and write </span>*/

  /* <span style="color: #b22222;">Create chunked dataset with index_dtype datatype and write indices into it </span>*/
    rc_write = trexio_hdf5_create_write_dset_sparse(f-&gt;$group$_group, dset_index_name, index_dtype, chunk_i_dims, index_p);
    <span style="color: #a020f0;">if</span> (index_p != index_sparse) FREE(index_p);
    <span style="color: #a020f0;">if</span> (rc_write != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc_write;

  /* <span style="color: #b22222;">Create chunked dataset with value_dtype datatype and write values into it </span>*/
    rc_write = trexio_hdf5_create_write_dset_sparse(f-&gt;$group$_group, dset_value_name, value_dtype, chunk_v_dims, value_sparse);
    <span style="color: #a020f0;">if</span> (rc_write != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc_write;

  } <span style="color: #a020f0;">else</span> {
  /* <span style="color: #b22222;">If the file exists -&gt; open it and write </span>*/
    <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">offset_i</span>[1] = {(<span style="color: #228b22;">hsize_t</span>) offset_file * $group_dset_rank$};
    <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">offset_v</span>[1] = {(<span style="color: #228b22;">hsize_t</span>) offset_file};

  /* <span style="color: #b22222;">Create chunked dataset with index_dtype datatype and write indices into it </span>*/
    rc_write = trexio_hdf5_open_write_dset_sparse(f-&gt;$group$_group, dset_index_name, index_dtype, chunk_i_dims, offset_i, index_p);
    <span style="color: #a020f0;">if</span> (index_p != index_sparse) FREE(index_p);
    <span style="color: #a020f0;">if</span> (rc_write != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc_write;

  /* <span style="color: #b22222;">Create chunked dataset with value_dtype datatype and write values into it </span>*/
    rc_write = trexio_hdf5_open_write_dset_sparse(f-&gt;$group$_group, dset_value_name, value_dtype, chunk_v_dims, offset_v, value_sparse);
    <span style="color: #a020f0;">if</span> (rc_write != TREXIO_SUCCESS) <span style="color: #a020f0;">return</span> rc_write;

  }

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_read_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>,
                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">offset_file</span>,
                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size</span>,
                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">size_max</span>,
                               <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof_read_size</span>,
                               <span style="color: #228b22;">int32_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">index_read</span>,
                               <span style="color: #228b22;">double</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">value_read</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;
  <span style="color: #a020f0;">if</span> (eof_read_size == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_5;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_hdf5_t</span>* <span style="color: #a0522d;">f</span> = (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_hdf5_t</span>*) file;

  /* <span style="color: #b22222;">Indices and values are stored as 2 independent datasets in the HDF5 file </span>*/
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">dset_index_name</span>[256];
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">dset_value_name</span>[256];
  /* <span style="color: #b22222;">Build the names of the datasets </span>*/
  strncpy(dset_index_name, $GROUP_DSET$_NAME <span style="color: #8b2252;">"_indices"</span>, 256);
  strncpy(dset_value_name, $GROUP_DSET$_NAME <span style="color: #8b2252;">"_values"</span>, 256);

  <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">offset_i</span>[1] = {(<span style="color: #228b22;">hsize_t</span>) offset_file * $group_dset_rank$};
  <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">count_i</span>[1] = {(<span style="color: #228b22;">hsize_t</span>) size * $group_dset_rank$};

  <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">offset_v</span>[1] = {(<span style="color: #228b22;">hsize_t</span>) offset_file};
  <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">count_v</span>[1] = {(<span style="color: #228b22;">hsize_t</span>) size};

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">is_index</span> = 1, <span style="color: #a0522d;">is_value</span> = 0;
  <span style="color: #228b22;">trexio_exit_code</span> <span style="color: #a0522d;">rc_read</span>;

  // <span style="color: #b22222;">attempt to read indices</span>
  rc_read = trexio_hdf5_open_read_dset_sparse(f-&gt;$group$_group, dset_index_name, offset_i, count_i, <span style="color: #008b8b;">NULL</span>, is_index, index_read);
  <span style="color: #a020f0;">if</span> (rc_read != TREXIO_SUCCESS &amp;&amp; rc_read != TREXIO_END) <span style="color: #a020f0;">return</span> rc_read;
  // <span style="color: #b22222;">attempt to read values</span>
  // <span style="color: #b22222;">when EOF is encountered - the count_v[0] is modified and contains the number of elements being read</span>
  rc_read = trexio_hdf5_open_read_dset_sparse(f-&gt;$group$_group, dset_value_name, offset_v, count_v, eof_read_size, is_value, value_read);
  <span style="color: #a020f0;">if</span> (rc_read != TREXIO_SUCCESS &amp;&amp; rc_read != TREXIO_END) <span style="color: #a020f0;">return</span> rc_read;

  <span style="color: #a020f0;">return</span> rc_read;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_read_$group_dset$_size</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>, <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">size_max</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_hdf5_t</span>* <span style="color: #a0522d;">f</span> = (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">trexio_hdf5_t</span>*) file;

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dset_id</span> = H5Dopen(f-&gt;$group$_group, $GROUP_DSET$_NAME <span style="color: #8b2252;">"_values"</span>, H5P_DEFAULT);
  <span style="color: #a020f0;">if</span> (dset_id &lt;= 0) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">fspace_id</span> = H5Dget_space(dset_id);
  <span style="color: #a020f0;">if</span> (fspace_id &lt; 0) {
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  // <span style="color: #b22222;">allocate space for the dimensions to be read</span>
  <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">ddims</span>[1] = {0};

  // <span style="color: #b22222;">get the rank and dimensions of the dataset</span>
  H5Sget_simple_extent_dims(fspace_id, ddims, <span style="color: #008b8b;">NULL</span>);

  H5Dclose(dset_id);
  H5Sclose(fspace_id);

  *size_max = (<span style="color: #228b22;">int64_t</span>) ddims[0];

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>


<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_has_$group_dset$</span> (<span style="color: #228b22;">trexio_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">file</span>)
{

  <span style="color: #a020f0;">if</span> (file == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ARG_1;

  <span style="color: #228b22;">trexio_hdf5_t</span>* <span style="color: #a0522d;">f</span> = (<span style="color: #228b22;">trexio_hdf5_t</span>*) file;

  <span style="color: #228b22;">herr_t</span> <span style="color: #a0522d;">status</span> = H5LTfind_dataset(f-&gt;$group$_group, $GROUP_DSET$_NAME <span style="color: #8b2252;">"_values"</span>);
  /* <span style="color: #b22222;">H5LTfind_dataset returns 1 if dataset exists, 0 otherwise </span>*/
  <span style="color: #a020f0;">if</span> (status == 1){
    <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
  } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (status == 0) {
    <span style="color: #a020f0;">return</span> TREXIO_HAS_NOT;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }

}
</pre>
</div>
</div>
</div>
