templator_hdf5.html
<div id="outline-container-orge07d0c5" class="outline-3">
<h3 id="orge07d0c5"><span class="section-number-3">1.9</span> Helper functions</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_create_write_dset_sparse</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">group_id</span>,
                                      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">dset_name</span>,
                                      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dtype_id</span>,
                                      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hsize_t</span>* <span style="color: #a0522d;">chunk_dims</span>,
                                      <span style="color: #a020f0;">const</span> <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">data_sparse</span>)
{
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">h5_rank</span> = 1;
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">maxdims</span>[1] = {H5S_UNLIMITED};

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dspace</span> = H5Screate_simple(h5_rank, chunk_dims, maxdims);
  <span style="color: #a020f0;">if</span> (dspace &lt; 0) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">prop</span> = H5Pcreate(H5P_DATASET_CREATE);
  <span style="color: #a020f0;">if</span> (prop &lt; 0) {
    H5Sclose(dspace);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  <span style="color: #228b22;">herr_t</span> <span style="color: #a0522d;">status</span> = H5Pset_chunk(prop, h5_rank, chunk_dims);
  <span style="color: #a020f0;">if</span> (status &lt; 0) {
    H5Sclose(dspace);
    H5Pclose(prop);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dset_id</span> = H5Dcreate(group_id,
                            dset_name,
                            dtype_id,
                            dspace,
                            H5P_DEFAULT,
                            prop,
                            H5P_DEFAULT);
  <span style="color: #a020f0;">if</span> (dset_id &lt; 0) {
    H5Sclose(dspace);
    H5Pclose(prop);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  status = H5Dwrite(dset_id,
                    dtype_id,
                    H5S_ALL, H5S_ALL, H5P_DEFAULT,
                    data_sparse);
  H5Sclose(dspace);
  H5Pclose(prop);
  H5Dclose(dset_id);
  <span style="color: #a020f0;">if</span> (status &lt; 0) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}


<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_open_write_dset_sparse</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">group_id</span>,
                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">dset_name</span>,
                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dtype_id</span>,
                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hsize_t</span>* <span style="color: #a0522d;">chunk_dims</span>,
                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hsize_t</span>* <span style="color: #a0522d;">offset_file</span>,
                                    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">data_sparse</span>)
{
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">h5_rank</span> = 1;

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dset_id</span> = H5Dopen(group_id, dset_name, H5P_DEFAULT);
  <span style="color: #a020f0;">if</span> (dset_id &lt;= 0) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">fspace</span> = H5Dget_space(dset_id);
  <span style="color: #a020f0;">if</span> (fspace &lt; 0) {
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  // <span style="color: #b22222;">allocate space for the dimensions to be read</span>
  <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">ddims</span>[1] = {0};

  // <span style="color: #b22222;">get the rank and dimensions of the dataset</span>
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rrank</span> = H5Sget_simple_extent_dims(fspace, ddims, <span style="color: #008b8b;">NULL</span>);
  <span style="color: #a020f0;">if</span> (rrank != h5_rank) {
    H5Sclose(fspace);
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }

  ddims[0] += chunk_dims[0];

  // <span style="color: #b22222;">extend the dset size</span>
  <span style="color: #228b22;">herr_t</span> <span style="color: #a0522d;">status</span>  = H5Dset_extent(dset_id, ddims);
  <span style="color: #a020f0;">if</span> (status &lt; 0) {
    H5Sclose(fspace);
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  // <span style="color: #b22222;">close and reopen the file dataspace to take into account the extension</span>
  H5Sclose(fspace);
  fspace = H5Dget_space(dset_id);
  <span style="color: #a020f0;">if</span> (fspace &lt; 0) {
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  // <span style="color: #b22222;">select hyperslab to be written using chunk_dims and offset values</span>
  status = H5Sselect_hyperslab(fspace, H5S_SELECT_SET, offset_file, <span style="color: #008b8b;">NULL</span>, chunk_dims, <span style="color: #008b8b;">NULL</span>);
  <span style="color: #a020f0;">if</span> (status &lt; 0) {
    H5Sclose(fspace);
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  // <span style="color: #b22222;">create memory dataspace to write from</span>
  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dspace</span> = H5Screate_simple(h5_rank, chunk_dims, <span style="color: #008b8b;">NULL</span>);
  <span style="color: #a020f0;">if</span> (dspace &lt; 0) {
    H5Sclose(fspace);
    H5Sclose(dspace);
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  status = H5Dwrite(dset_id,
                    dtype_id,
                    dspace, fspace, H5P_DEFAULT,
                    data_sparse);
  H5Dclose(dset_id);
  H5Sclose(dspace);
  H5Sclose(fspace);
  <span style="color: #a020f0;">if</span> (status &lt; 0) <span style="color: #a020f0;">return</span> TREXIO_FAILURE;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}


<span style="color: #228b22;">trexio_exit_code</span>
<span style="color: #0000ff;">trexio_hdf5_open_read_dset_sparse</span> (<span style="color: #a020f0;">const</span> <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">group_id</span>,
                                   <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">dset_name</span>,
                                   <span style="color: #a020f0;">const</span> <span style="color: #228b22;">hsize_t</span>* <span style="color: #a0522d;">offset_file</span>,
                                   <span style="color: #228b22;">hsize_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">size_read</span>,
                                   <span style="color: #228b22;">int64_t</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">eof_read_size</span>,
                                   <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">is_index</span>,
                                   <span style="color: #228b22;">void</span>* <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">data_sparse</span>
                                   )
{
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">h5_rank</span> = 1;

  // <span style="color: #b22222;">get the dataset handle</span>
  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dset_id</span> = H5Dopen(group_id, dset_name, H5P_DEFAULT);
  <span style="color: #a020f0;">if</span> (dset_id &lt;= 0) <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;

  // <span style="color: #b22222;">get the dataspace of the dataset</span>
  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">fspace_id</span> = H5Dget_space(dset_id);
  <span style="color: #a020f0;">if</span> (fspace_id &lt; 0) {
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  /* <span style="color: #b22222;">get dims of the dset stored in the file to check whether reading with user-provided chunk size</span>
<span style="color: #b22222;">     will reach end of the dataset (i.e. EOF in TEXT back end)</span>
<span style="color: #b22222;">   </span>*/
  <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">ddims</span>[1] = {0};
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rrank</span> = H5Sget_simple_extent_dims(fspace_id, ddims, <span style="color: #008b8b;">NULL</span>);
  <span style="color: #a020f0;">if</span> (rrank != h5_rank) {
    H5Sclose(fspace_id);
    H5Dclose(dset_id);
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }

  <span style="color: #228b22;">hsize_t</span> <span style="color: #a0522d;">max_offset</span> = offset_file[0] + size_read[0];

  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">is_EOF</span> = 0;
  // <span style="color: #b22222;">if max_offset exceed current dim of the dset =&gt; EOF</span>
  <span style="color: #a020f0;">if</span> (max_offset &gt; ddims[0]) {
    is_EOF = 1;
    // <span style="color: #b22222;">lower the value of count to reduce the number of elements which will be read</span>
    size_read[0] -= max_offset - ddims[0];
    // <span style="color: #b22222;">modified the value of eof_read_size passed by address</span>
    <span style="color: #a020f0;">if</span> (eof_read_size != <span style="color: #008b8b;">NULL</span>) *eof_read_size = size_read[0];
  }

  // <span style="color: #b22222;">special case when reading int indices</span>
  <span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">size_ranked</span> = (<span style="color: #228b22;">uint64_t</span>) size_read[0];
  <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">index_p</span> = <span style="color: #008b8b;">NULL</span>;
  // <span style="color: #b22222;">read the datatype from the dataset and compare with the pre-defined values</span>
  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">dtype</span> = H5Dget_type(dset_id);
  <span style="color: #a020f0;">if</span> (is_index == 1) {
    <span style="color: #a020f0;">if</span> (H5Tequal(dtype, H5T_NATIVE_UINT8) &gt; 0) {
      <span style="color: #228b22;">uint8_t</span>* <span style="color: #a0522d;">index</span> = CALLOC(size_ranked, uint8_t);
      <span style="color: #a020f0;">if</span> (index == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;
      index_p = index;
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (H5Tequal(dtype, H5T_NATIVE_UINT16) &gt; 0) {
      <span style="color: #228b22;">uint16_t</span>* <span style="color: #a0522d;">index</span> = CALLOC(size_ranked, uint16_t);
      <span style="color: #a020f0;">if</span> (index == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> TREXIO_ALLOCATION_FAILED;
      index_p = index;
    } <span style="color: #a020f0;">else</span> {
      index_p = data_sparse;
    }
  }

  <span style="color: #228b22;">herr_t</span> <span style="color: #a0522d;">status</span> = H5Sselect_hyperslab(fspace_id, H5S_SELECT_SET, offset_file, <span style="color: #008b8b;">NULL</span>, size_read, <span style="color: #008b8b;">NULL</span>);
  <span style="color: #a020f0;">if</span> (status &lt; 0) {
    H5Sclose(fspace_id);
    H5Dclose(dset_id);
    <span style="color: #a020f0;">if</span> (index_p != data_sparse) FREE(index_p);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  <span style="color: #228b22;">hid_t</span> <span style="color: #a0522d;">memspace_id</span> = H5Screate_simple(h5_rank, size_read, <span style="color: #008b8b;">NULL</span>);
  <span style="color: #a020f0;">if</span> (memspace_id &lt; 0) {
    H5Sclose(fspace_id);
    H5Dclose(dset_id);
    <span style="color: #a020f0;">if</span> (index_p != data_sparse) FREE(index_p);
    <span style="color: #a020f0;">return</span> TREXIO_INVALID_ID;
  }

  <span style="color: #a020f0;">if</span> (is_index == 1) {
    status = H5Dread(dset_id,
                     dtype,
                     memspace_id, fspace_id, H5P_DEFAULT,
                     index_p);
  } <span style="color: #a020f0;">else</span> {
    status = H5Dread(dset_id,
                     dtype,
                     memspace_id, fspace_id, H5P_DEFAULT,
                     data_sparse);
  }

  H5Sclose(fspace_id);
  H5Sclose(memspace_id);
  H5Dclose(dset_id);
  <span style="color: #a020f0;">if</span> (status &lt; 0) {
    <span style="color: #a020f0;">if</span> (index_p != data_sparse) FREE(index_p);
    <span style="color: #a020f0;">return</span> TREXIO_FAILURE;
  }

  <span style="color: #a020f0;">if</span> (is_index == 1) {
    <span style="color: #a020f0;">if</span> (H5Tequal(dtype, H5T_NATIVE_UINT8) &gt; 0) {
      <span style="color: #228b22;">uint8_t</span>* <span style="color: #a0522d;">index</span> = (<span style="color: #228b22;">uint8_t</span>*) index_p;
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;size_ranked; ++i){
        ((<span style="color: #228b22;">int32_t</span>*)data_sparse)[i] = (<span style="color: #228b22;">int32_t</span>) index[i];
      }
      FREE(index_p);
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (H5Tequal(dtype, H5T_NATIVE_UINT16) &gt; 0) {
      <span style="color: #228b22;">uint16_t</span>* <span style="color: #a0522d;">index</span> = (<span style="color: #228b22;">uint16_t</span>*) index_p;
      <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">uint64_t</span> <span style="color: #a0522d;">i</span>=0; i&lt;size_ranked; ++i){
        ((<span style="color: #228b22;">int32_t</span>*)data_sparse)[i] = (<span style="color: #228b22;">int32_t</span>) index[i];
      }
      FREE(index_p);
    }
  }

  <span style="color: #a020f0;">if</span> (is_EOF == 1) <span style="color: #a020f0;">return</span> TREXIO_END;

  <span style="color: #a020f0;">return</span> TREXIO_SUCCESS;
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: TREX-CoE</p>
<p class="date">Created: 2022-01-07 Fri 10:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
